[NoCoverage] BlockStatement
src/common/adapters/current-date-generator.ts:4:15
 import { IDateGenerator } from '../ports/date-generator.interface';
 
 export class CurrentDateGenerator implements IDateGenerator {
-  now(): Date {
-    return new Date();
-  }
+  now(): Date {}
 
   currentDateAtMidnight(): Date {

[NoCoverage] BlockStatement
src/common/adapters/current-date-generator.ts:8:33
     return new Date();
   }
 
-  currentDateAtMidnight(): Date {
-    const now = this.now();
-    return new Date(now.getFullYear(), now.getMonth(), now.getDate());
-  }
+  currentDateAtMidnight(): Date {}
 }
 
