[Survived] ArrayDeclaration
src/users/adapters/fake-password-hasher.ts:4:33
 import { IPasswordHasher } from '../ports/password-hasher.interface';
 
 export class FakePasswordHasher implements IPasswordHasher {
-  private hashCalls: string[] = [];
+  private hashCalls: string[] = ["Stryker was here"];
 
   async hash(password: string): Promise<string> {

[Killed] BlockStatement
src/users/adapters/fake-password-hasher.ts:6:49
 export class FakePasswordHasher implements IPasswordHasher {
   private hashCalls: string[] = [];
 
-  async hash(password: string): Promise<string> {
-    this.hashCalls.push(password);
-    return `hashed-${password}`;
-  }
+  async hash(password: string): Promise<string> {}
 
   async compare(password: string, hash: string): Promise<boolean> {
killedBy: Feature: Register Happy path should hash the password before saving it
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "12345678"
Received array: []

[NoCoverage] BlockStatement
src/users/adapters/fake-password-hasher.ts:11:67
     return `hashed-${password}`;
   }
 
-  async compare(password: string, hash: string): Promise<boolean> {
-    return `hashed-${password}` === hash;
-  }
+  async compare(password: string, hash: string): Promise<boolean> {}
 
   getHashCalls(): string[] {

[NoCoverage] ConditionalExpression
src/users/adapters/fake-password-hasher.ts:12:12
   }
 
   async compare(password: string, hash: string): Promise<boolean> {
-    return `hashed-${password}` === hash;
+    return true;
   }
 

[NoCoverage] ConditionalExpression
src/users/adapters/fake-password-hasher.ts:12:12
   }
 
   async compare(password: string, hash: string): Promise<boolean> {
-    return `hashed-${password}` === hash;
+    return false;
   }
 

[Killed] BlockStatement
src/users/adapters/fake-password-hasher.ts:15:28
     return `hashed-${password}` === hash;
   }
 
-  getHashCalls(): string[] {
-    return this.hashCalls;
-  }
+  getHashCalls(): string[] {}
 }
 
killedBy: Feature: Register Happy path should hash the password before saving it
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined
