[NoCoverage] BlockStatement
src/common/adapters/random-id-generator.ts:4:22
 import { IIdGenerator } from '../ports/id-generator.interface';
 
 export class RandomIdGenerator implements IIdGenerator {
-  generate(): string {
-    return crypto.randomUUID();
-  }
+  generate(): string {}
 }
 
