[Killed] BlockStatement
src/users/exceptions/confirm-password.ts:4:17
 import { BadRequestException } from '@nestjs/common';
 
 export class ConfirmPasswordException extends BadRequestException {
-  constructor() {
-    super("Password and confirm password fields don't match");
-  }
+  constructor() {}
 }
 
killedBy: Feature: Register Unhappy path should fail if password and confirm password fields are not equals
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Password and confirm password fields don't match"
Received message:   "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {
      54 |       stryCov_9fa48("161");
    > 55 |       super(stryMutAct_9fa48("162") ? "" : (stryCov_9fa48("162"), "Passwor
