[Killed] BlockStatement
src/users/exceptions/password-length.ts:4:17
 import { BadRequestException } from '@nestjs/common';
 
 export class PasswordLengthException extends BadRequestException {
-  constructor() {
-    super('Password length must be greater than or equal to 8');
-  }
+  constructor() {}
 }
 
killedBy: Feature: Register Unhappy path should fail if password length is less than 8
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Password length must be greater than or equal to 8"
Received message:   "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {
      54 |       stryCov_9fa48("167");
    > 55 |       super(stryMutAct_9fa48("168") ? "" : (stryCov_9fa48("168"), 'Passw
