[NoCoverage] BlockStatement
src/core/pipes/zod-validation.pipe.ts:8:27
 export class ZodValidationPipe implements PipeTransform {
   constructor(private schema: z.Schema<any>) {}
 
-  transform(payload: any) {
-    const result = this.schema.safeParse(payload);
-
-    if (result.success === true) return result.data;
-    throw new BadRequestException('Failed to validate');
-  }
+  transform(payload: any) {}
 }
 

[NoCoverage] EqualityOperator
src/core/pipes/zod-validation.pipe.ts:11:9
   transform(payload: any) {
     const result = this.schema.safeParse(payload);
 
-    if (result.success === true) return result.data;
+    if (result.success !== true) return result.data;
     throw new BadRequestException('Failed to validate');
   }

[NoCoverage] ConditionalExpression
src/core/pipes/zod-validation.pipe.ts:11:9
   transform(payload: any) {
     const result = this.schema.safeParse(payload);
 
-    if (result.success === true) return result.data;
+    if (false) return result.data;
     throw new BadRequestException('Failed to validate');
   }
