[NoCoverage] ArrayDeclaration
src/habits/adapters/in-memory-tracked-repository.ts:5:50
 import { ITrackedHabitRepository } from '../ports/tracked-habit-repository.interface';
 
 export class InMemoryTrackedHabitRepository implements ITrackedHabitRepository {
-  constructor(private database: TrackedHabit[] = []) {}
+  constructor(private database: TrackedHabit[] = ["Stryker was here"]) {}
 
   async create(trackedHabit: TrackedHabit): Promise<void> {

[Killed] BlockStatement
src/habits/adapters/in-memory-tracked-repository.ts:7:59
 export class InMemoryTrackedHabitRepository implements ITrackedHabitRepository {
   constructor(private database: TrackedHabit[] = []) {}
 
-  async create(trackedHabit: TrackedHabit): Promise<void> {
-    this.database.push(trackedHabit);
-  }
+  async create(trackedHabit: TrackedHabit): Promise<void> {}
 
   async findByHabitIdAndDate(
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/habits/adapters/in-memory-tracked-repository.ts:14:35
   async findByHabitIdAndDate(
     habitId: string,
     date: string,
-  ): Promise<TrackedHabit | null> {
-    const trackedHabitIndex = this.database.findIndex(
-      (trackedHabit) =>
-        trackedHabit.props.habitId === habitId &&
-        trackedHabit.props.date === date,
-    );
-
-    if (trackedHabitIndex < 0) return null;
-
-    return new TrackedHabit({ ...this.database[trackedHabitIndex].props });
-  }
+  ): Promise<TrackedHabit | null> {}
 
   async update(trackedHabit: TrackedHabit) {
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] ArrowFunction
src/habits/adapters/in-memory-tracked-repository.ts:16:7
     date: string,
   ): Promise<TrackedHabit | null> {
     const trackedHabitIndex = this.database.findIndex(
-      (trackedHabit) =>
-        trackedHabit.props.habitId === habitId &&
-        trackedHabit.props.date === date,
+      () => undefined,
     );
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: TypeError: Cannot read properties of null (reading 'props')

[Killed] LogicalOperator
src/habits/adapters/in-memory-tracked-repository.ts:17:9
   ): Promise<TrackedHabit | null> {
     const trackedHabitIndex = this.database.findIndex(
       (trackedHabit) =>
-        trackedHabit.props.habitId === habitId &&
-        trackedHabit.props.date === date,
+        trackedHabit.props.habitId === habitId || trackedHabit.props.date === date,
     );
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "date": "2023-01-03",
+   "date": "2023-01-02",

[Killed] ConditionalExpression
src/habits/adapters/in-memory-tracked-repository.ts:17:9
   ): Promise<TrackedHabit | null> {
     const trackedHabitIndex = this.database.findIndex(
       (trackedHabit) =>
-        trackedHabit.props.habitId === habitId &&
+        true &&
         trackedHabit.props.date === date,
     );
killedBy: Feature : complete a tracked habit Unhappy path Scenario: complete tracked habit related to a non-existing habit should fail
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/habits/adapters/in-memory-tracked-repository.ts:18:9
     const trackedHabitIndex = this.database.findIndex(
       (trackedHabit) =>
         trackedHabit.props.habitId === habitId &&
-        trackedHabit.props.date === date,
+        true,
     );
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "date": "2023-01-03",
+   "date": "2023-01-02",

[Killed] EqualityOperator
src/habits/adapters/in-memory-tracked-repository.ts:18:9
     const trackedHabitIndex = this.database.findIndex(
       (trackedHabit) =>
         trackedHabit.props.habitId === habitId &&
-        trackedHabit.props.date === date,
+        trackedHabit.props.date !== date,
     );
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: TypeError: Cannot read properties of null (reading 'props')

[Killed] EqualityOperator
src/habits/adapters/in-memory-tracked-repository.ts:21:9
         trackedHabit.props.date === date,
     );
 
-    if (trackedHabitIndex < 0) return null;
+    if (trackedHabitIndex <= 0) return null;
 
     return new TrackedHabit({ ...this.database[trackedHabitIndex].props });
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: TypeError: Cannot read properties of null (reading 'props')

[Killed] ConditionalExpression
src/habits/adapters/in-memory-tracked-repository.ts:21:9
         trackedHabit.props.date === date,
     );
 
-    if (trackedHabitIndex < 0) return null;
+    if (true) return null;
 
     return new TrackedHabit({ ...this.database[trackedHabitIndex].props });
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: TypeError: Cannot read properties of null (reading 'props')

[Killed] BlockStatement
src/habits/adapters/in-memory-tracked-repository.ts:26:44
     return new TrackedHabit({ ...this.database[trackedHabitIndex].props });
   }
 
-  async update(trackedHabit: TrackedHabit) {
-    const trackedHabitIndex = this.database.findIndex(
-      (_trackedHabit) =>
-        _trackedHabit.props.habitId === trackedHabit.props.habitId &&
-        _trackedHabit.props.date === trackedHabit.props.date,
-    );
-
-    if (trackedHabitIndex < 0) return;
-
-    this.database[trackedHabitIndex] = trackedHabit;
-    trackedHabit.commit();
-  }
+  async update(trackedHabit: TrackedHabit) {}
 
   count(): number {
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "date": "2023-01-02",
    "habitId": "id-1",

[Killed] ArrowFunction
src/habits/adapters/in-memory-tracked-repository.ts:28:7
 
   async update(trackedHabit: TrackedHabit) {
     const trackedHabitIndex = this.database.findIndex(
-      (_trackedHabit) =>
-        _trackedHabit.props.habitId === trackedHabit.props.habitId &&
-        _trackedHabit.props.date === trackedHabit.props.date,
+      () => undefined,
     );
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "date": "2023-01-02",
    "habitId": "id-1",

[Killed] ConditionalExpression
src/habits/adapters/in-memory-tracked-repository.ts:29:9
   async update(trackedHabit: TrackedHabit) {
     const trackedHabitIndex = this.database.findIndex(
       (_trackedHabit) =>
-        _trackedHabit.props.habitId === trackedHabit.props.habitId &&
-        _trackedHabit.props.date === trackedHabit.props.date,
+        false,
     );
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "date": "2023-01-02",
    "habitId": "id-1",

[Killed] EqualityOperator
src/habits/adapters/in-memory-tracked-repository.ts:29:9
   async update(trackedHabit: TrackedHabit) {
     const trackedHabitIndex = this.database.findIndex(
       (_trackedHabit) =>
-        _trackedHabit.props.habitId === trackedHabit.props.habitId &&
+        _trackedHabit.props.habitId !== trackedHabit.props.habitId &&
         _trackedHabit.props.date === trackedHabit.props.date,
     );
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "date": "2023-01-02",
    "habitId": "id-1",

[Killed] EqualityOperator
src/habits/adapters/in-memory-tracked-repository.ts:30:9
     const trackedHabitIndex = this.database.findIndex(
       (_trackedHabit) =>
         _trackedHabit.props.habitId === trackedHabit.props.habitId &&
-        _trackedHabit.props.date === trackedHabit.props.date,
+        _trackedHabit.props.date !== trackedHabit.props.date,
     );
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "date": "2023-01-02",
    "habitId": "id-1",

[Survived] ConditionalExpression
src/habits/adapters/in-memory-tracked-repository.ts:30:9
     const trackedHabitIndex = this.database.findIndex(
       (_trackedHabit) =>
         _trackedHabit.props.habitId === trackedHabit.props.habitId &&
-        _trackedHabit.props.date === trackedHabit.props.date,
+        true,
     );
 

[Killed] EqualityOperator
src/habits/adapters/in-memory-tracked-repository.ts:33:9
         _trackedHabit.props.date === trackedHabit.props.date,
     );
 
-    if (trackedHabitIndex < 0) return;
+    if (trackedHabitIndex <= 0) return;
 
     this.database[trackedHabitIndex] = trackedHabit;
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "date": "2023-01-02",
    "habitId": "id-1",

[Killed] EqualityOperator
src/habits/adapters/in-memory-tracked-repository.ts:33:9
         _trackedHabit.props.date === trackedHabit.props.date,
     );
 
-    if (trackedHabitIndex < 0) return;
+    if (trackedHabitIndex >= 0) return;
 
     this.database[trackedHabitIndex] = trackedHabit;
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "date": "2023-01-02",
    "habitId": "id-1",

[Killed] BlockStatement
src/habits/adapters/in-memory-tracked-repository.ts:39:19
     trackedHabit.commit();
   }
 
-  count(): number {
-    return this.database.length;
-  }
+  count(): number {}
 }
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: undefined
