[NoCoverage] BooleanLiteral
src/habits/contract.ts:21:42
 
   export namespace CompleteHabit {
     export const schema = z.object({
-      date: z.string().refine((value) => !isNaN(Date.parse(value))),
+      date: z.string().refine((value) => isNaN(Date.parse(value))),
     });
 

[NoCoverage] ArrowFunction
src/habits/contract.ts:21:31
 
   export namespace CompleteHabit {
     export const schema = z.object({
-      date: z.string().refine((value) => !isNaN(Date.parse(value))),
+      date: z.string().refine(() => undefined),
     });
 
