[NoCoverage] BlockStatement
src/habits/habit.controller.ts:18:5
   async handleCreateAHabitToTrack(
     @Body(new ZodValidationPipe(HabitAPI.CreateAHabitToTrack.schema))
     body: HabitAPI.CreateAHabitToTrack.Request,
-  ) {
-    return await this.createAHabitToTrack.execute({
-      ...body,
-      userId: 'bob',
-    });
-  }
+  ) {}
 
   @Post('/habits/:habitId/complete')

[NoCoverage] ObjectLiteral
src/habits/habit.controller.ts:19:51
     @Body(new ZodValidationPipe(HabitAPI.CreateAHabitToTrack.schema))
     body: HabitAPI.CreateAHabitToTrack.Request,
   ) {
-    return await this.createAHabitToTrack.execute({
-      ...body,
-      userId: 'bob',
-    });
+    return await this.createAHabitToTrack.execute({});
   }
 

[NoCoverage] BlockStatement
src/habits/habit.controller.ts:30:5
     @Body(new ZodValidationPipe(HabitAPI.CompleteHabit.schema))
     body: HabitAPI.CompleteHabit.Request,
     @Param('habitId') habitId: string,
-  ) {
-    return await this.completeHabit.execute({
-      ...body,
-      habitId,
-      user: {
-        props: {
-          id: 'bob',
-        },
-      },
-    });
-  }
+  ) {}
 }
 

[NoCoverage] ObjectLiteral
src/habits/habit.controller.ts:31:45
     body: HabitAPI.CompleteHabit.Request,
     @Param('habitId') habitId: string,
   ) {
-    return await this.completeHabit.execute({
-      ...body,
-      habitId,
-      user: {
-        props: {
-          id: 'bob',
-        },
-      },
-    });
+    return await this.completeHabit.execute({});
   }
 }
