[NoCoverage] StringLiteral
src/habits/ports/habit-repository.interface.ts:3:35
 import { Habit } from '../entities/habit.entity';
 
-export const I_HABIT_REPOSITORY = 'I_HABIT_REPOSITORY';
+export const I_HABIT_REPOSITORY = "";
 export interface IHabitRepository {
   create(habit: Habit): Promise<void>;
