[Killed] BlockStatement
src/users/adapters/in-memory-user-repository.ts:7:52
 export class InMemoryUserRepository implements IUserRepository {
   constructor(private database: User[] = []) {}
 
-  async findById(id: string): Promise<User | null> {
-    return this.database.find((user) => user.props.id === id) ?? null;
-  }
+  async findById(id: string): Promise<User | null> {}
 
   async findByEmail(email: string): Promise<User | null> {
killedBy: Feature: Register Happy path should persists the created user
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] EqualityOperator
src/users/adapters/in-memory-user-repository.ts:8:41
   constructor(private database: User[] = []) {}
 
   async findById(id: string): Promise<User | null> {
-    return this.database.find((user) => user.props.id === id) ?? null;
+    return this.database.find((user) => user.props.id !== id) ?? null;
   }
 
killedBy: Feature: Register Happy path should persists the created user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "email": "alice@gmail.com",
-   "id": "id-1",

[Killed] ConditionalExpression
src/users/adapters/in-memory-user-repository.ts:8:41
   constructor(private database: User[] = []) {}
 
   async findById(id: string): Promise<User | null> {
-    return this.database.find((user) => user.props.id === id) ?? null;
+    return this.database.find((user) => true) ?? null;
   }
 
killedBy: Feature: Register Happy path should persists the created user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "email": "alice@gmail.com",
-   "id": "id-1",

[Killed] BlockStatement
src/users/adapters/in-memory-user-repository.ts:11:58
     return this.database.find((user) => user.props.id === id) ?? null;
   }
 
-  async findByEmail(email: string): Promise<User | null> {
-    return this.database.find((user) => user.props.email === email) ?? null;
-  }
+  async findByEmail(email: string): Promise<User | null> {}
 
   async create(user: User): Promise<void> {
killedBy: Feature: Register Unhappy path should fail if the email is already used
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"id": "id-1"}

[Killed] ConditionalExpression
src/users/adapters/in-memory-user-repository.ts:12:41
   }
 
   async findByEmail(email: string): Promise<User | null> {
-    return this.database.find((user) => user.props.email === email) ?? null;
+    return this.database.find((user) => true) ?? null;
   }
 
killedBy: Feature: Register Happy path should return an id
statusReason: EmailAlreadyUsedException: Email already used

[Killed] ConditionalExpression
src/users/adapters/in-memory-user-repository.ts:12:41
   }
 
   async findByEmail(email: string): Promise<User | null> {
-    return this.database.find((user) => user.props.email === email) ?? null;
+    return this.database.find((user) => false) ?? null;
   }
 
killedBy: Feature: Register Unhappy path should fail if the email is already used
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"id": "id-1"}

[Killed] BlockStatement
src/users/adapters/in-memory-user-repository.ts:15:43
     return this.database.find((user) => user.props.email === email) ?? null;
   }
 
-  async create(user: User): Promise<void> {
-    this.database.push(user);
-  }
+  async create(user: User): Promise<void> {}
 }
 
killedBy: Feature: Register Happy path should persists the created user
statusReason: TypeError: Cannot read properties of null (reading 'props')
