[NoCoverage] ObjectLiteral
src/users/contract.ts:5:36
 
 export namespace UserAPI {
   export namespace Register {
-    export const schema = z.object({
-      email: z.string(),
-      password: z.string(),
-      confirmPassword: z.string(),
-    });
+    export const schema = z.object({});
 
     export type Request = z.infer<typeof schema>;
