[NoCoverage] BlockStatement
src/users/user.controller.ts:10:64
   constructor(private readonly register: Register) {}
 
   @Post('/users/register')
-  async handleRegister(@Body() body: UserAPI.Register.Request) {
-    return await this.register.execute({ ...body });
-  }
+  async handleRegister(@Body() body: UserAPI.Register.Request) {}
 }
 
