[Killed] BlockStatement
src/common/adapters/fixed-date-generator.ts:4:9
 import { IDateGenerator } from '../ports/date-generator.interface';
 
 export class FixedDateGenerator implements IDateGenerator {
-  now() {
-    return new Date('2024-01-01T00:00:00.000Z');
-  }
+  now() {}
 
   currentDateAtMidnight(): Date {
killedBy: Feature : complete a tracked habit Unhappy path Scenario: complete tracked habit in the future should fail
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/common/adapters/fixed-date-generator.ts:5:21
 
 export class FixedDateGenerator implements IDateGenerator {
   now() {
-    return new Date('2024-01-01T00:00:00.000Z');
+    return new Date("");
   }
 
killedBy: Feature : complete a tracked habit Unhappy path Scenario: complete tracked habit in the future should fail
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/common/adapters/fixed-date-generator.ts:8:33
     return new Date('2024-01-01T00:00:00.000Z');
   }
 
-  currentDateAtMidnight(): Date {
-    return new Date('2024-01-01T00:00:00.000Z');
-  }
+  currentDateAtMidnight(): Date {}
 }
 
killedBy: Feature : create a habit to track Happy path should save the habit in the persistence layer
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,8 +3,8 @@
    "cue": "After my breakfast",
    "id": "id-1",
