[Killed] BlockStatement
src/common/adapters/fixed-id-generator.ts:4:22
 import { IIdGenerator } from '../ports/id-generator.interface';
 
 export class FixedIdGenerator implements IIdGenerator {
-  generate(): string {
-    return 'id-1';
-  }
+  generate(): string {}
 }
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "date": "2023-01-03",
    "habitId": "id-1",
