[Killed] BlockStatement
src/habits/adapters/in-memory-habit-repository.ts:7:45
 export class InMemoryHabitRepository implements IHabitRepository {
   constructor(private database: Array<Habit> = []) {}
 
-  async create(habit: Habit): Promise<void> {
-    this.database.push(habit);
-  }
+  async create(habit: Habit): Promise<void> {}
 
   async findById(habitId: string): Promise<Habit | null> {
killedBy: Feature : create a habit to track Happy path should save the habit in the persistence layer
statusReason: TypeError: Cannot read properties of null (reading 'props')

[Killed] BlockStatement
src/habits/adapters/in-memory-habit-repository.ts:11:58
     this.database.push(habit);
   }
 
-  async findById(habitId: string): Promise<Habit | null> {
-    return this.database.find((habit) => habit.props.id === habitId) ?? null;
-  }
+  async findById(habitId: string): Promise<Habit | null> {}
 }
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] ConditionalExpression
src/habits/adapters/in-memory-habit-repository.ts:12:42
   }
 
   async findById(habitId: string): Promise<Habit | null> {
-    return this.database.find((habit) => habit.props.id === habitId) ?? null;
+    return this.database.find((habit) => false) ?? null;
   }
 }
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: HabitNotFoundException: Habit not found

[Killed] EqualityOperator
src/habits/adapters/in-memory-habit-repository.ts:12:42
   }
 
   async findById(habitId: string): Promise<Habit | null> {
-    return this.database.find((habit) => habit.props.id === habitId) ?? null;
+    return this.database.find((habit) => habit.props.id !== habitId) ?? null;
   }
 }
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: HabitNotFoundException: Habit not found
