[Survived] BlockStatement
src/habits/entities/tracked-habit.entity.ts:14:48
 export class TrackedHabit {
   public initialProps: TrackedHabitProps;
 
-  constructor(public props: TrackedHabitProps) {
-    this.initialProps = { ...this.props };
-  }
+  constructor(public props: TrackedHabitProps) {}
 
   isInTheFuture(currentDate: Date) {

[Killed] BlockStatement
src/habits/entities/tracked-habit.entity.ts:18:36
     this.initialProps = { ...this.props };
   }
 
-  isInTheFuture(currentDate: Date) {
-    return new Date(this.props.date) > currentDate;
-  }
+  isInTheFuture(currentDate: Date) {}
 
   isBeforeStartDate(startDate: Date) {
killedBy: Feature : complete a tracked habit Unhappy path Scenario: complete tracked habit in the future should fail
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/habits/entities/tracked-habit.entity.ts:19:12
   }
 
   isInTheFuture(currentDate: Date) {
-    return new Date(this.props.date) > currentDate;
+    return true;
   }
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: TrackedHabitDateInFutureException: Tracked habit date cannot be in the future

[Killed] EqualityOperator
src/habits/entities/tracked-habit.entity.ts:19:12
   }
 
   isInTheFuture(currentDate: Date) {
-    return new Date(this.props.date) > currentDate;
+    return new Date(this.props.date) <= currentDate;
   }
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: TrackedHabitDateInFutureException: Tracked habit date cannot be in the future

[Killed] BlockStatement
src/habits/entities/tracked-habit.entity.ts:22:38
     return new Date(this.props.date) > currentDate;
   }
 
-  isBeforeStartDate(startDate: Date) {
-    return new Date(this.props.date) < startDate;
-  }
+  isBeforeStartDate(startDate: Date) {}
 
   update(data: Partial<TrackedHabitProps>) {
killedBy: Feature : complete a tracked habit Unhappy path Scenario: complete tracked habit before the tracked from date should fail
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/habits/entities/tracked-habit.entity.ts:23:12
   }
 
   isBeforeStartDate(startDate: Date) {
-    return new Date(this.props.date) < startDate;
+    return true;
   }
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: CompletionDateBeforeHabitsStartDateException: Completion date must be after the habit's start date.

[Killed] ConditionalExpression
src/habits/entities/tracked-habit.entity.ts:23:12
   }
 
   isBeforeStartDate(startDate: Date) {
-    return new Date(this.props.date) < startDate;
+    return false;
   }
 
killedBy: Feature : complete a tracked habit Unhappy path Scenario: complete tracked habit before the tracked from date should fail
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/habits/entities/tracked-habit.entity.ts:26:44
     return new Date(this.props.date) < startDate;
   }
 
-  update(data: Partial<TrackedHabitProps>) {
-    this.props = {
-      ...this.props,
-      ...data,
-    };
-  }
+  update(data: Partial<TrackedHabitProps>) {}
 
   commit() {
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "date": "2023-01-02",
    "habitId": "id-1",

[Survived] BlockStatement
src/habits/entities/tracked-habit.entity.ts:33:12
     };
   }
 
-  commit() {
-    this.initialProps = { ...this.props };
-  }
+  commit() {}
 }
 
