[Killed] BlockStatement
src/habits/exceptions/completion-date-before-habits-start-date.ts:4:17
 import { BadRequestException } from '@nestjs/common';
 
 export class CompletionDateBeforeHabitsStartDateException extends BadRequestException {
-  constructor() {
-    super("Completion date must be after the habit's start date.");
-  }
+  constructor() {}
 }
 
killedBy: Feature : complete a tracked habit Unhappy path Scenario: complete tracked habit before the tracked from date should fail
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Completion date must be after the habit's start date."
Received message:   "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {
      54 |       stryCov_9fa48("78");
    > 55 |       super(stryMutAct_9fa48("79") ? "" : (stryCov_9fa48("79"), "Compl
