[Killed] BlockStatement
src/habits/exceptions/habit-not-found.ts:4:17
 import { NotFoundException } from '@nestjs/common';
 
 export class HabitNotFoundException extends NotFoundException {
-  constructor() {
-    super('Habit not found');
-  }
+  constructor() {}
 }
 
killedBy: Feature : complete a tracked habit Unhappy path Scenario: complete tracked habit related to a non-existing habit should fail
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Habit not found"
Received message:   "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {
      54 |       stryCov_9fa48("80");
    > 55 |       super(stryMutAct_9fa48("81") ? "" : (stryCov_9fa48("81"), 'Habit not found'));
