[Killed] BlockStatement
src/habits/exceptions/tracked-habit-date-in-future.ts:4:17
 import { BadRequestException } from '@nestjs/common';
 
 export class TrackedHabitDateInFutureException extends BadRequestException {
-  constructor() {
-    super('Tracked habit date cannot be in the future');
-  }
+  constructor() {}
 }
 
killedBy: Feature : complete a tracked habit Unhappy path Scenario: complete tracked habit in the future should fail
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Tracked habit date cannot be in the future"
Received message:   "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {
      54 |       stryCov_9fa48("82");
    > 55 |       super(stryMutAct_9fa48("83") ? "" : (stryCov_9fa48("83"), 'Tracked habit da
