[Killed] BlockStatement
src/habits/usecases/complete-habit.ts:27:50
     private readonly dateGenerator: IDateGenerator,
   ) {}
 
-  async execute(request: Request): Promise<void> {
-    const existingTrackedHabit =
-      await this.trackedHabitRepository.findByHabitIdAndDate(
-        request.habitId,
-        request.date,
-      );
-
-    if (existingTrackedHabit) {
-      await this.completeExistingTrackedHabit(existingTrackedHabit);
-    } else {
-      await this.createNewTrackedHabit(request);
-    }
-  }
+  async execute(request: Request): Promise<void> {}
 
   private async completeExistingTrackedHabit(
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "date": "2023-01-02",
    "habitId": "id-1",

[Killed] ConditionalExpression
src/habits/usecases/complete-habit.ts:34:9
         request.date,
       );
 
-    if (existingTrackedHabit) {
+    if (false) {
       await this.completeExistingTrackedHabit(existingTrackedHabit);
     } else {
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "date": "2023-01-02",
    "habitId": "id-1",

[Killed] ConditionalExpression
src/habits/usecases/complete-habit.ts:34:9
         request.date,
       );
 
-    if (existingTrackedHabit) {
+    if (true) {
       await this.completeExistingTrackedHabit(existingTrackedHabit);
     } else {
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: TypeError: Cannot read properties of null (reading 'update')

[Killed] BlockStatement
src/habits/usecases/complete-habit.ts:36:12
 
     if (existingTrackedHabit) {
       await this.completeExistingTrackedHabit(existingTrackedHabit);
-    } else {
-      await this.createNewTrackedHabit(request);
-    }
+    } else {}
   }
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/habits/usecases/complete-habit.ts:43:20
 
   private async completeExistingTrackedHabit(
     trackedHabit: TrackedHabit,
-  ): Promise<void> {
-    trackedHabit.update({
-      status: 'COMPLETED',
-    });
-
-    await this.trackedHabitRepository.update(trackedHabit);
-  }
+  ): Promise<void> {}
 
   private async createNewTrackedHabit({
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does already exist should complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "date": "2023-01-02",
    "habitId": "id-1",

[Killed] BlockStatement
src/habits/usecases/complete-habit.ts:55:30
     habitId,
     date,
     user,
-  }: Request): Promise<void> {
-    const newTrackedHabit = this.createTrackedHabit(
-      habitId,
-      date,
-      user.props.id,
-    );
-
-    const habit = await this.habitRepository.findById(habitId);
-
-    this.validateNewTrackedHabit(newTrackedHabit, habit);
-
-    await this.trackedHabitRepository.create(newTrackedHabit);
-  }
+  }: Request): Promise<void> {}
 
   private createTrackedHabit(
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/habits/usecases/complete-habit.ts:73:19
     habitId: string,
     date: string,
     userId: string,
-  ): TrackedHabit {
-    return new TrackedHabit({
-      date,
-      habitId,
-      id: this.idGenerator.generate(),
-      status: 'COMPLETED',
-      userId,
-    });
-  }
+  ): TrackedHabit {}
 
   private validateNewTrackedHabit(
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: TypeError: Cannot read properties of undefined (reading 'isInTheFuture')

[Killed] StringLiteral
src/habits/usecases/complete-habit.ts:78:15
       date,
       habitId,
       id: this.idGenerator.generate(),
-      status: 'COMPLETED',
+      status: "",
       userId,
     });
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "date": "2023-01-03",
    "habitId": "id-1",

[Killed] BlockStatement
src/habits/usecases/complete-habit.ts:86:11
   private validateNewTrackedHabit(
     newTrackedHabit: TrackedHabit,
     habit: Habit | null,
-  ): void {
-    if (newTrackedHabit.isInTheFuture(this.dateGenerator.now()))
-      throw new TrackedHabitDateInFutureException();
-
-    if (habit === null) throw new HabitNotFoundException();
-
-    if (newTrackedHabit.isBeforeStartDate(habit.props.trackedFrom))
-      throw new CompletionDateBeforeHabitsStartDateException();
-  }
+  ): void {}
 }
 
killedBy: Feature : complete a tracked habit Unhappy path Scenario: complete tracked habit related to a non-existing habit should fail
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/habits/usecases/complete-habit.ts:87:9
     newTrackedHabit: TrackedHabit,
     habit: Habit | null,
   ): void {
-    if (newTrackedHabit.isInTheFuture(this.dateGenerator.now()))
+    if (true)
       throw new TrackedHabitDateInFutureException();
 
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: TrackedHabitDateInFutureException: Tracked habit date cannot be in the future

[Killed] ConditionalExpression
src/habits/usecases/complete-habit.ts:87:9
     newTrackedHabit: TrackedHabit,
     habit: Habit | null,
   ): void {
-    if (newTrackedHabit.isInTheFuture(this.dateGenerator.now()))
+    if (false)
       throw new TrackedHabitDateInFutureException();
 
killedBy: Feature : complete a tracked habit Unhappy path Scenario: complete tracked habit in the future should fail
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/habits/usecases/complete-habit.ts:90:9
     if (newTrackedHabit.isInTheFuture(this.dateGenerator.now()))
       throw new TrackedHabitDateInFutureException();
 
-    if (habit === null) throw new HabitNotFoundException();
+    if (false) throw new HabitNotFoundException();
 
     if (newTrackedHabit.isBeforeStartDate(habit.props.trackedFrom))
killedBy: Feature : complete a tracked habit Unhappy path Scenario: complete tracked habit related to a non-existing habit should fail
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Habit not found"
Received message:   "Cannot read properties of null (reading 'props')"

      136 |       if (stryMutAct_9fa48("108") ? false : stryMutAct_9fa48("107") ? true : (stryCov_9fa48("107", "108"), newTrackedHabit.isInTheFuture(this.dateGenerator.now()))) throw new TrackedHabitDateInFutureException();
      137 |

[Killed] EqualityOperator
src/habits/usecases/complete-habit.ts:90:9
     if (newTrackedHabit.isInTheFuture(this.dateGenerator.now()))
       throw new TrackedHabitDateInFutureException();
 
-    if (habit === null) throw new HabitNotFoundException();
+    if (habit !== null) throw new HabitNotFoundException();
 
     if (newTrackedHabit.isBeforeStartDate(habit.props.trackedFrom))
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: HabitNotFoundException: Habit not found

[Killed] ConditionalExpression
src/habits/usecases/complete-habit.ts:92:9
 
     if (habit === null) throw new HabitNotFoundException();
 
-    if (newTrackedHabit.isBeforeStartDate(habit.props.trackedFrom))
+    if (true)
       throw new CompletionDateBeforeHabitsStartDateException();
   }
killedBy: Feature : complete a tracked habit Happy path Scenario: tracked habit does not already exist should create and complete the tracked habit
statusReason: CompletionDateBeforeHabitsStartDateException: Completion date must be after the habit's start date.

[Killed] ConditionalExpression
src/habits/usecases/complete-habit.ts:92:9
 
     if (habit === null) throw new HabitNotFoundException();
 
-    if (newTrackedHabit.isBeforeStartDate(habit.props.trackedFrom))
+    if (false)
       throw new CompletionDateBeforeHabitsStartDateException();
   }
killedBy: Feature : complete a tracked habit Unhappy path Scenario: complete tracked habit before the tracked from date should fail
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
