[Killed] BlockStatement
src/habits/usecases/create-a-habit-to-track.ts:26:61
     private readonly dateGenerator: IDateGenerator,
   ) {}
 
-  public async execute(request: Request): Promise<Response> {
-    const id = this.idGenerator.generate();
-    const trackedFrom = this.dateGenerator.currentDateAtMidnight();
-
-    const habit = new Habit({
-      id,
-      ...request,
-      trackedFrom,
-    });
-
-    await this.habitRepository.create(habit);
-    return { id };
-  }
+  public async execute(request: Request): Promise<Response> {}
 }
 
killedBy: Feature : create a habit to track Happy path should create a new habit and return an id
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/habits/usecases/create-a-habit-to-track.ts:30:29
     const id = this.idGenerator.generate();
     const trackedFrom = this.dateGenerator.currentDateAtMidnight();
 
-    const habit = new Habit({
-      id,
-      ...request,
-      trackedFrom,
-    });
+    const habit = new Habit({});
 
     await this.habitRepository.create(habit);
killedBy: Feature : create a habit to track Happy path should save the habit in the persistence layer
statusReason: TypeError: Cannot read properties of null (reading 'props')

[Killed] ObjectLiteral
src/habits/usecases/create-a-habit-to-track.ts:37:12
     });
 
     await this.habitRepository.create(habit);
-    return { id };
+    return {};
   }
 }
killedBy: Feature : create a habit to track Happy path should create a new habit and return an id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "id-1"
Received: undefined
