[Killed] BlockStatement
src/users/exceptions/email-already-used.ts:4:17
 import { BadRequestException } from '@nestjs/common';
 
 export class EmailAlreadyUsedException extends BadRequestException {
-  constructor() {
-    super('Email already used');
-  }
+  constructor() {}
 }
 
killedBy: Feature: Register Unhappy path should fail if the email is already used
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Email already used"
Received message:   "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {
      54 |       stryCov_9fa48("163");
    > 55 |       super(stryMutAct_9fa48("164") ? "" : (stryCov_9fa48("164"), 'Email already used'));
