[Killed] BlockStatement
src/users/exceptions/email-format.ts:4:17
 import { BadRequestException } from '@nestjs/common';
 
 export class EmailFormatException extends BadRequestException {
-  constructor() {
-    super('Invalid email format');
-  }
+  constructor() {}
 }
 
killedBy: Feature: Register Unhappy path should fail if the email is not valid
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Invalid email format"
Received message:   "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {
      54 |       stryCov_9fa48("165");
    > 55 |       super(stryMutAct_9fa48("166") ? "" : (stryCov_9fa48("166"), 'Invalid email format'));

[Killed] StringLiteral
src/users/exceptions/email-format.ts:5:11
 
 export class EmailFormatException extends BadRequestException {
   constructor() {
-    super('Invalid email format');
+    super("");
   }
 }
killedBy: Feature: Register Unhappy path should fail if the email is not valid
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Invalid email format"
Received message:   "Bad Request"

      125 |         } else {
      126 |           stryCov_9fa48("189");
    > 127 |           throw new EmailFormatException();
