[Killed] BlockStatement
src/users/usecases/register.ts:27:54
     private readonly passwordHasher: IPasswordHasher,
   ) {}
 
-  async execute(request: Request): Promise<Response> {
-    this.validateEmail(request.email);
-    this.validatePassword(request.password);
-    this.validateConfirmPassword(request.password, request.confirmPassword);
-    await this.validateEmailIsFree(request.email);
-
-    const hashedPassword = await this.passwordHasher.hash(request.password);
-
-    const createdUser = new User({
-      id: this.idGenerator.generate(),
-      email: request.email,
-      password: hashedPassword,
-    });
-
-    await this.userRepository.create(createdUser);
-
-    return {
-      id: createdUser.props.id,
-    };
-  }
+  async execute(request: Request): Promise<Response> {}
 
   private validatePassword(password: string): void {
killedBy: Feature: Register Happy path should return an id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": "id-1"}
Received: undefined

[Killed] BlockStatement
src/users/usecases/register.ts:48:52
     };
   }
 
-  private validatePassword(password: string): void {
-    if (password.length < 8) {
-      throw new PasswordLengthException();
-    }
-  }
+  private validatePassword(password: string): void {}
 
   private validateConfirmPassword(
killedBy: Feature: Register Unhappy path should fail if password length is less than 8
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"id": "id-1"}

[Killed] ConditionalExpression
src/users/usecases/register.ts:49:9
   }
 
   private validatePassword(password: string): void {
-    if (password.length < 8) {
+    if (false) {
       throw new PasswordLengthException();
     }
killedBy: Feature: Register Unhappy path should fail if password length is less than 8
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"id": "id-1"}

[Killed] BlockStatement
src/users/usecases/register.ts:49:30
   }
 
   private validatePassword(password: string): void {
-    if (password.length < 8) {
-      throw new PasswordLengthException();
-    }
+    if (password.length < 8) {}
   }
 
killedBy: Feature: Register Unhappy path should fail if password length is less than 8
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"id": "id-1"}

[Killed] BlockStatement
src/users/usecases/register.ts:57:11
   private validateConfirmPassword(
     password: string,
     confirmPassword: string,
-  ): void {
-    if (password !== confirmPassword) {
-      throw new ConfirmPasswordException();
-    }
-  }
+  ): void {}
 
   private validateEmail(email: string): void {
killedBy: Feature: Register Unhappy path should fail if password and confirm password fields are not equals
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"id": "id-1"}

[Killed] ConditionalExpression
src/users/usecases/register.ts:58:9
     password: string,
     confirmPassword: string,
   ): void {
-    if (password !== confirmPassword) {
+    if (false) {
       throw new ConfirmPasswordException();
     }
killedBy: Feature: Register Unhappy path should fail if password and confirm password fields are not equals
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"id": "id-1"}

[Killed] BlockStatement
src/users/usecases/register.ts:58:39
     password: string,
     confirmPassword: string,
   ): void {
-    if (password !== confirmPassword) {
-      throw new ConfirmPasswordException();
-    }
+    if (password !== confirmPassword) {}
   }
 
killedBy: Feature: Register Unhappy path should fail if password and confirm password fields are not equals
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"id": "id-1"}

[Killed] BlockStatement
src/users/usecases/register.ts:63:46
     }
   }
 
-  private validateEmail(email: string): void {
-    if (!this.isValidEmail(email)) {
-      throw new EmailFormatException();
-    }
-  }
+  private validateEmail(email: string): void {}
 
   private async validateEmailIsFree(email: string): Promise<void> {
killedBy: Feature: Register Unhappy path should fail if the email is not valid
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"id": "id-1"}

[Killed] BlockStatement
src/users/usecases/register.ts:64:36
   }
 
   private validateEmail(email: string): void {
-    if (!this.isValidEmail(email)) {
-      throw new EmailFormatException();
-    }
+    if (!this.isValidEmail(email)) {}
   }
 
killedBy: Feature: Register Unhappy path should fail if the email is not valid
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"id": "id-1"}

[Killed] ConditionalExpression
src/users/usecases/register.ts:64:9
   }
 
   private validateEmail(email: string): void {
-    if (!this.isValidEmail(email)) {
+    if (true) {
       throw new EmailFormatException();
     }
killedBy: Feature: Register Happy path should return an id
statusReason: EmailFormatException: Invalid email format

[Killed] BlockStatement
src/users/usecases/register.ts:69:67
     }
   }
 
-  private async validateEmailIsFree(email: string): Promise<void> {
-    if (await this.userRepository.findByEmail(email)) {
-      throw new EmailAlreadyUsedException();
-    }
-  }
+  private async validateEmailIsFree(email: string): Promise<void> {}
 
   private isValidEmail(email: string): boolean {
killedBy: Feature: Register Unhappy path should fail if the email is already used
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"id": "id-1"}

[Killed] BlockStatement
src/users/usecases/register.ts:70:55
   }
 
   private async validateEmailIsFree(email: string): Promise<void> {
-    if (await this.userRepository.findByEmail(email)) {
-      throw new EmailAlreadyUsedException();
-    }
+    if (await this.userRepository.findByEmail(email)) {}
   }
 
killedBy: Feature: Register Unhappy path should fail if the email is already used
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"id": "id-1"}

[Killed] ConditionalExpression
src/users/usecases/register.ts:70:9
   }
 
   private async validateEmailIsFree(email: string): Promise<void> {
-    if (await this.userRepository.findByEmail(email)) {
+    if (true) {
       throw new EmailAlreadyUsedException();
     }
killedBy: Feature: Register Happy path should return an id
statusReason: EmailAlreadyUsedException: Email already used

[Killed] BlockStatement
src/users/usecases/register.ts:75:48
     }
   }
 
-  private isValidEmail(email: string): boolean {
-    const emailRegex = /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,}$/i;
-    return emailRegex.test(email);
-  }
+  private isValidEmail(email: string): boolean {}
 }
 
killedBy: Feature: Register Happy path should return an id
statusReason: EmailFormatException: Invalid email format

[Killed] Regex
src/users/usecases/register.ts:76:24
   }
 
   private isValidEmail(email: string): boolean {
-    const emailRegex = /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,}$/i;
+    const emailRegex = /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]$/i;
     return emailRegex.test(email);
   }
killedBy: Feature: Register Happy path should return an id
statusReason: EmailFormatException: Invalid email format

[Killed] Regex
src/users/usecases/register.ts:76:24
   }
 
   private isValidEmail(email: string): boolean {
-    const emailRegex = /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,}$/i;
+    const emailRegex = /^[A-Z0-9._%+-]+@[^A-Z0-9.-]+\.[A-Z]{2,}$/i;
     return emailRegex.test(email);
   }
killedBy: Feature: Register Happy path should return an id
statusReason: EmailFormatException: Invalid email format
